* GULL1_thermistor2
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | GULL1_thermistor2
Place name                       | Sermeq Avannerleq
Geographic location              | Central West Greenland
Site type                        | Ice sheet
Data Source                      | L체thi email
Data DOI                         | 
Science Source                   | Ryser, C., L체thi, M. P., Andrews, L. C., Hoffman, M. J., Catania, G. A., Hawley, R. L., ... & Kristensen, S. S. (2014). Sustained high basal motion of the Greenland ice sheet revealed by borehole deformation. Journal of Glaciology, 60(222), 647-660.
Science DOI                      | 10.3189/2014JoG13J196
Date                             | 2011-07-25
Longitude [째E]                   | -49.7182
Latitude [째N]                    | 69.4524
Location Source                  | 10.3189/2014JoG13J196
Depth of top measurement [m]     | 12.0
Depth of bottom measurement [m]  | 300
Ice thickness [m]                | 705
Coverage [% of thickness]        | 41
Ice thickness source             | Ryser, 2014 (Table 3). 705/707 for thickness
Note                             | See FOXX1/temperature_foxx_gull_streamlined.org
#+end_example

** Temperature

See FOXX1/temperature_foxx_gull_streamlined.org

** Thickness

** Location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|   d |         t |
|  12 |  -1.44675 |
|  48 |  -1.03728 |
|  84 |  -0.84861 |
| 120 |  -1.76445 |
| 156 |  -2.88491 |
| 192 |   -4.5268 |
| 228 |  -6.42528 |
| 264 |  -8.39668 |
| 300 | -10.17722 |

